/*
	Склад: код товара, название товара, количество на складе,
	стоимость единицы товара, описание товара,
	номер и ФИО поставщика товара, срок поставки,
	количество товаров в поставке
*/

create database Склад


create table Товар (
	код_товара	int identity(1,1) not null primary key,
	название	nvarchar(50) not null,
	количество	int not null,
	стоимость	float not null,
	описание	nvarchar(50) null,
)


create table Поставщики (
	номер_поставщика int identity(100,1) not null primary key,
	фамилия			 nvarchar(50) not null,
)


create table Заказы (
	номер_поставщика int not null foreign key references Поставщики(номер_поставщика),
	код_товара		 int not null foreign key references Товар(код_товара),
	срок_поставки	 date not null,
	количество		 int not null,
)


create table Районы_поставки (
	район nvarchar(50) not null,
	номер_поставщика int not null foreign key references Поставщики(номер_поставщика),
)





insert into Товар(название, количество, стоимость, описание) values
	('Телевизор', 10, 3.5, null),
	('Стул', 5, 5, null),
	('Стол', 13, 5, null),
	('Часы', 0, 2, null),
	('Ковёр', 15, 4.5, null),
	('Клавиатура', 50, 5, null),
	('Микроволновка', 8, 10, null),
	('Холодильник', 1, 30, null),
	('Люстра', 3, 150, null),
	('Монитор', 5, 10, null);


insert into Поставщики(фамилия) values
	('Смирнов'),
	('Петров'),
	('Сидоров'),
	('Моисеев'),
	('Дубов'),
	('Семенов'),
	('Степанов'),
	('Кириллов'),
	('Максимов'),
	('Дорохов');


insert into Заказы(номер_поставщика, код_товара, срок_поставки, количество) values
	(100, 2, '2015-05-15', 5),
	(101, 2, '2020-08-20', 10),
	(102, 1, '2020-08-20', 2),
	(103, 3, '2021-01-05', 3),
	(104, 5, '2018-12-29', 1),
	(105, 6, '2019-12-29', 6),
	(106, 6, '2018-12-29', 7),
	(107, 7, '2016-10-01', 84),
	(108, 8, '2015-05-15', 10),
	(109, 10, '2021-06-10', 5);


insert into Районы_поставки(номер_поставщика, район) values
	(100, 'Ленинский'),
	(101, 'Фрунзенский'),
	(101, 'Яблочный'),
	(102, 'Бронный'),
	(103, 'Бронный'),
	(104, 'Новый'),
	(105, 'Ленинский'),
	(106, 'Яблочный'),
	(107, 'Малый'),
	(108, 'Новый'),
	(109, 'Жуковский');