/*
	Склад: код товара, название товара, количество на складе,
	стоимость единицы товара, описание товара,
	номер и ФИО поставщика товара, срок поставки,
	количество товаров в поставке
*/

CREATE DATABASE Склад
USE Склад


CREATE TABLE Товар (
	код_товара		int IDENTITY(1,1) NOT NULL PRIMARY KEY,
	название_товара nvarchar(50) NOT NULL,
	количество		int NOT NULL,
)


CREATE TABLE Стоимость (
	код_товара int NOT NULL FOREIGN KEY REFERENCES Товар(код_товара),
	стоимость  float NOT NULL,
	описание   nvarchar(50) NULL,
)


CREATE TABLE Поставщики (
	код_товара				int NOT NULL FOREIGN KEY REFERENCES Товар(код_товара),
	номер_поставщика		int IDENTITY (1,1) NOT NULL,
	ФИО_поставщика			nvarchar(50) NOT NULL,
	срок_поставки			date NOT NULL,
	количество_в_поставке	int NOT NULL,
)


INSERT INTO Товар(название_товара, количество) VALUES
	('Телевизор', 3),
	('Стул', 5),
	('Стол', 5),
	('Часы', 18),
	('Ковёр', 15),
	('Клавиатура', 10),
	('Микроволновка', 13),
	('Холодильник', 15),
	('Люстра', 3),
	('Монитор', 25);


INSERT INTO Стоимость VALUES
	(1, 25.5, NULL),
	(2, 12, NULL),
	(3, 12, NULL),
	(4, 3.5, NULL),
	(5, 5.2, NULL),
	(6, 10, NULL),
	(7, 13.5, NULL),
	(8, 16.99, NULL),
	(9, 43.99, NULL),
	(10, 12.7, NULL);


INSERT INTO Поставщики(код_товара, ФИО_поставщика, срок_поставки, количество_в_поставке) VALUES
	(1, 'Смирнов', '2015-05-15', 5),
	(2, 'Петров', '2020-08-20', 10),
	(3, 'Сидоров', '2020-08-20', 2),
	(4, 'Моисеев', '2021-01-5', 3),
	(5, 'Дубов', '2018-12-29', 15),
	(6, 'Семенов', '2018-12-28', 4),
	(7, 'Степанов', '2016-10-01', 100),
	(8, 'Кириллов', '2017-10-09', 8),
	(9, 'Максимов', '2020-08-20', 2),
	(10, 'Шпагин', '2017-10-09', 15);