/*
	Склад: код товара, название товара, количество на складе,
	стоимость единицы товара, описание товара,
	номер и ФИО поставщика товара, срок поставки,
	количество товаров в поставке
*/

CREATE DATABASE Склад
USE Склад


CREATE TABLE Товар (
	код_товара		int IDENTITY(1,1) NOT NULL PRIMARY KEY,
	название		nvarchar(50) NOT NULL,
	стоимость		float NOT NULL,
	описание		nvarchar NULL,
)


CREATE TABLE На_складе (
	код_товара		int IDENTITY(1,1) NOT NULL FOREIGN KEY REFERENCES Товар(код_товара),
	количество		int NOT NULL,
)


CREATE TABLE Поставщики (
	код_товара				int NOT NULL FOREIGN KEY REFERENCES Товар(код_товара),
	номер_поставщика		int IDENTITY (130,1) NOT NULL PRIMARY KEY,
	ФИО_поставщика			nvarchar(50) NOT NULL,
)


CREATE TABLE Заказы (
	номер_поставщика		int NOT NULL FOREIGN KEY REFERENCES Поставщики(номер_поставщика),
	срок_поставки			date NOT NULL,
	количество_в_поставке	int NOT NULL,
)


INSERT INTO Товар(название, стоимость, описание) VALUES
	('Телевизор', 3.5, NULL),
	('Стул', 5.5, NULL),
	('Стол', 5.5, NULL),
	('Часы', 18.99, NULL),
	('Ковёр', 15, NULL),
	('Клавиатура', 10.12, NULL),
	('Микроволновка', 13.99, NULL),
	('Холодильник', 15, NULL),
	('Люстра', 3.99, NULL),
	('Монитор', 25.01, NULL);


INSERT INTO На_складе(количество) VALUES
	(25),
	(12),
	(12),
	(3),
	(5),
	(10),
	(13),
	(16),
	(43),
	(12);


INSERT INTO Поставщики(код_товара, ФИО_поставщика) VALUES
	(1, 'Смирнов'),
	(2, 'Петров'),
	(2, 'Сидоров'),
	(3, 'Моисеев'),
	(4, 'Дубов'),
	(5, 'Семенов'),
	(6, 'Степанов'),
	(7, 'Кириллов'),
	(8,'Максимов'),
	(9, 'Шпагин'),
	(10,'Шпагин');


INSERT INTO Заказы(номер_поставщика, срок_поставки, количество_в_поставке) VALUES
	(131, '2015-05-15', 5),
	(132, '2020-08-20', 10),
	(133, '2020-08-20', 2),
	(134, '2021-01-5', 3),
	(135, '2018-12-29', 15),
	(135, '2016-01-01', 20),
	(136, '2018-12-28', 4),
	(137, '2016-10-01', 100),
	(138, '2017-10-09', 8),
	(139, '2020-08-20', 2),
	(140, '2017-10-09', 15),
	(141, '2015-05-15', 10);